ecto_erd.dot
digraph {
  ranksep=1.0; rankdir=LR;
  node [shape = none, fontname="Roboto Mono"];
  "Diagrammeditor.Accounts.User" [label= <<table align='left' border='1' style='rounded' cellspacing='0' cellpadding='4' cellborder='0'><tr><td port='header@schema_module'><font point-size='18'>   Diagrammeditor.Accounts.User   </font></td></tr><tr><td border='1' sides='b' colspan='2'><font point-size='14'><i>users</i></font></td></tr><tr><td align='left' port='field@id'>:id                  <i><font color='gray54'>:id                 </font></i></td></tr><tr><td align='left' port='field@email'>:email               <i><font color='gray54'>:string             </font></i></td></tr><tr><td align='left' port='field@hashed_password'>:hashed_password     <i><font color='gray54'>:string             </font></i></td></tr><tr><td align='left' port='field@confirmed_at'>:confirmed_at        <i><font color='gray54'>:naive_datetime     </font></i></td></tr><tr><td align='left' port='field@inserted_at'>:inserted_at         <i><font color='gray54'>:naive_datetime     </font></i></td></tr><tr><td align='left' port='field@updated_at'>:updated_at          <i><font color='gray54'>:naive_datetime     </font></i></td></tr></table>>]
  "Diagrammeditor.Accounts.UserToken" [label= <<table align='left' border='1' style='rounded' cellspacing='0' cellpadding='4' cellborder='0'><tr><td port='header@schema_module'><font point-size='18'>   Diagrammeditor.Accounts.UserToken   </font></td></tr><tr><td border='1' sides='b' colspan='2'><font point-size='14'><i>users_tokens</i></font></td></tr><tr><td align='left' port='field@id'>:id              <i><font color='gray54'>:id                 </font></i></td></tr><tr><td align='left' port='field@token'>:token           <i><font color='gray54'>:binary             </font></i></td></tr><tr><td align='left' port='field@context'>:context         <i><font color='gray54'>:string             </font></i></td></tr><tr><td align='left' port='field@sent_to'>:sent_to         <i><font color='gray54'>:string             </font></i></td></tr><tr><td align='left' port='field@user_id'>:user_id         <i><font color='gray54'>:id                 </font></i></td></tr><tr><td align='left' port='field@inserted_at'>:inserted_at     <i><font color='gray54'>:naive_datetime     </font></i></td></tr></table>>]
  "Diagrammeditor.Processes.Process" [label= <<table align='left' border='1' style='rounded' cellspacing='0' cellpadding='4' cellborder='0'><tr><td port='header@schema_module'><font point-size='18'>   Diagrammeditor.Processes.Process   </font></td></tr><tr><td border='1' sides='b' colspan='2'><font point-size='14'><i>processes</i></font></td></tr><tr><td align='left' port='field@id'>:id              <i><font color='gray54'>:id                                          </font></i></td></tr><tr><td align='left' port='field@description'>:description     <i><font color='gray54'>:string                                      </font></i></td></tr><tr><td align='left' port='field@name'>:name            <i><font color='gray54'>:string                                      </font></i></td></tr><tr><td align='left' port='field@status'>:status          <i><font color='gray54'>#Enum&lt;[:empty, :finished, :in_progress]&gt;     </font></i></td></tr><tr><td align='left' port='field@flowchart'>:flowchart       <i><font color='gray54'>:map                                         </font></i></td></tr><tr><td align='left' port='field@user_id'>:user_id         <i><font color='gray54'>:id                                          </font></i></td></tr><tr><td align='left' port='field@inserted_at'>:inserted_at     <i><font color='gray54'>:naive_datetime                              </font></i></td></tr><tr><td align='left' port='field@updated_at'>:updated_at      <i><font color='gray54'>:naive_datetime                              </font></i></td></tr></table>>]
  "Diagrammeditor.Processes.Step" [label= <<table align='left' border='1' style='rounded' cellspacing='0' cellpadding='4' cellborder='0'><tr><td port='header@schema_module'><font point-size='18'>   Diagrammeditor.Processes.Step   </font></td></tr><tr><td border='1' sides='b' colspan='2'><font point-size='14'><i>steps</i></font></td></tr><tr><td align='left' port='field@id'>:id              <i><font color='gray54'>:id                 </font></i></td></tr><tr><td align='left' port='field@description'>:description     <i><font color='gray54'>:string             </font></i></td></tr><tr><td align='left' port='field@name'>:name            <i><font color='gray54'>:string             </font></i></td></tr><tr><td align='left' port='field@type'>:type            <i><font color='gray54'>:string             </font></i></td></tr><tr><td align='left' port='field@step_id'>:step_id         <i><font color='gray54'>:integer            </font></i></td></tr><tr><td align='left' port='field@process_id'>:process_id      <i><font color='gray54'>:id                 </font></i></td></tr><tr><td align='left' port='field@inserted_at'>:inserted_at     <i><font color='gray54'>:naive_datetime     </font></i></td></tr><tr><td align='left' port='field@updated_at'>:updated_at      <i><font color='gray54'>:naive_datetime     </font></i></td></tr></table>>]
  "Ecto.Migration.SchemaMigration" [label= <<table align='left' border='1' style='rounded' cellspacing='0' cellpadding='4' cellborder='0'><tr><td port='header@schema_module'><font point-size='18'>   Ecto.Migration.SchemaMigration   </font></td></tr><tr><td border='1' sides='b' colspan='2'><font point-size='14'><i>schema_migrations</i></font></td></tr><tr><td align='left' port='field@version'>:version         <i><font color='gray54'>:integer            </font></i></td></tr><tr><td align='left' port='field@inserted_at'>:inserted_at     <i><font color='gray54'>:naive_datetime     </font></i></td></tr></table>>]

  "Diagrammeditor.Processes.Process":"field@id":e -> "Diagrammeditor.Processes.Step":"field@process_id":w
  "Diagrammeditor.Accounts.User":"field@id":e -> "Diagrammeditor.Processes.Process":"field@user_id":w
  "Diagrammeditor.Accounts.User":"field@id":e -> "Diagrammeditor.Accounts.UserToken":"field@user_id":w
}
